micropython/micropython/ports/esp32/machine_uart.c
    // If UART is being freshly initialised then restore object defaults
    if (!uart_is_driver_installed(self->uart_num)) {
        self->bits = 8;
        self->parity = 0;
        self->stop = 1;
        self->rts = UART_PIN_NO_CHANGE;
        self->cts = UART_PIN_NO_CHANGE;
        self->txbuf = 256;
        self->rxbuf = 256; // IDF minimum
        self->timeout = 0;
        self->timeout_char = 0;
        self->invert = 0;
        self->flowcontrol = 0;
        self->uart_event_task = NULL;
        self->uart_queue = NULL;
        self->rxidle_state = RXIDLE_INACTIVE;

        // Set the MicroPython default UART pins. These may be overwritten with
        // caller-provided pins, below
        switch (self->uart_num) {
            case UART_NUM_0:
                self->rx = UART_PIN_NO_CHANGE; // GPIO 3
                self->tx = UART_PIN_NO_CHANGE; // GPIO 1
                break;
            case UART_NUM_1:
                #if CONFIG_IDF_TARGET_ESP32 && CONFIG_SPIRAM
                // ESP32 usually uses pins 9 and 10 for SPIRAM bus, so avoid those pins as defaults.
                self->rx = 4;
                self->tx = 5;
                #else
                self->rx = 9;
                self->tx = 10;
                #endif
                break;
            #if SOC_UART_HP_NUM > 2
            case UART_NUM_2:
                self->rx = 16;
                self->tx = 17;
                break;
            #endif
            #if SOC_UART_LP_NUM >= 1
            case LP_UART_NUM_0:
                self->rx = 4;
                self->tx = 5;
                break;
            #endif
            #if SOC_UART_HP_NUM > 3
            case UART_NUM_3:
                break;
            #endif
            #if SOC_UART_HP_NUM > 4
            case UART_NUM_4:
                break;
            #endif
            case UART_NUM_MAX:
                assert(0); // Range is checked in mp_machine_uart_make_new, value should be unreachable
        }
    } else {
        // wait for all data to be transmitted before changing settings
        uart_wait_tx_done(self->uart_num, pdMS_TO_TICKS(1000));
    }

    // Default driver parameters, should correspond to values set above
    uart_config_t uartcfg = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 0,
        .source_clk = UART_SOURCE_CLK,
    };


    if ((args[ARG_txbuf].u_int >= 0 && args[ARG_txbuf].u_int != self->txbuf) || (args[ARG_rxbuf].u_int >= 0 && args[ARG_rxbuf].u_int != self->rxbuf)) {
        if (uart_is_repl(self->uart_num)) {
            mp_raise_ValueError(MP_ERROR_TEXT("REPL UART buffer size is fixed"));
        }

        if (args[ARG_txbuf].u_int >= 0) {
            self->txbuf = args[ARG_txbuf].u_int;
        }
        if (args[ARG_rxbuf].u_int >= 0) {
            self->rxbuf = args[ARG_rxbuf].u_int;
        }

        // must reinitialise driver to change the tx/rx buffer size
        if (uart_is_driver_installed(self->uart_num)) {
            // Update uartcfg with the current uart parameters
            uint32_t baudrate;
            check_esp_err(uart_get_baudrate(self->uart_num, &baudrate));
            uartcfg.baud_rate = baudrate;
            check_esp_err(uart_get_word_length(self->uart_num, &uartcfg.data_bits));
            check_esp_err(uart_get_parity(self->uart_num, &uartcfg.parity));
            check_esp_err(uart_get_stop_bits(self->uart_num, &uartcfg.stop_bits));
            // De-initialise the driver
            mp_machine_uart_deinit(self);
        }
    }

    if (!uart_is_repl(self->uart_num) && !uart_is_driver_installed(self->uart_num)) {
        // install the driver if needed - could be uninstalled for multiple reasons:
        // 1. First time initialising this UART
        // 2. Has been temporarily de-initialised to change the buffer size
        // 3. Python code called .deinit() and now .init()
        check_esp_err(uart_param_config(self->uart_num, &uartcfg));
        check_esp_err(uart_driver_install(self->uart_num, self->rxbuf, self->txbuf, UART_QUEUE_SIZE, &self->uart_queue, 0));
        if (self->mp_irq_obj != NULL && self->mp_irq_obj->handler != mp_const_none) {
            uart_event_task_create(self);
        }
    }

    // set baudrate
    uint32_t baudrate = 115200;
    if (args[ARG_baudrate].u_int > 0) {
        check_esp_err(uart_set_baudrate(self->uart_num, args[ARG_baudrate].u_int));
    }
    check_esp_err(uart_get_baudrate(self->uart_num, &baudrate));

    // set pins
    #define SET_PIN(prop, arg) if (arg != MP_OBJ_NULL) prop = mp_obj_is_int(arg) && mp_obj_get_int(arg) == -1 ? UART_PIN_NO_CHANGE : machine_pin_get_id(arg);
    SET_PIN(self->tx, args[ARG_tx].u_obj);
    SET_PIN(self->rx, args[ARG_rx].u_obj);
    SET_PIN(self->rts, args[ARG_rts].u_obj);
    SET_PIN(self->cts, args[ARG_cts].u_obj);
    check_esp_err(uart_set_pin(self->uart_num, self->tx, self->rx, self->rts, self->cts));

    // set data bits
    switch (args[ARG_bits].u_int) {
        case 0:
            break;
        case 5:
            check_esp_err(uart_set_word_length(self->uart_num, UART_DATA_5_BITS));
            self->bits = 5;
            break;
        case 6:
            check_esp_err(uart_set_word_length(self->uart_num, UART_DATA_6_BITS));
            self->bits = 6;
            break;
        case 7:
            check_esp_err(uart_set_word_length(self->uart_num, UART_DATA_7_BITS));
            self->bits = 7;
            break;
        case 8:
            check_esp_err(uart_set_word_length(self->uart_num, UART_DATA_8_BITS));
            self->bits = 8;
            break;
        default:
            mp_raise_ValueError(MP_ERROR_TEXT("invalid data bits"));
            break;
    }

    // set parity
    if (args[ARG_parity].u_obj != MP_OBJ_NULL) {
        if (args[ARG_parity].u_obj == mp_const_none) {
            check_esp_err(uart_set_parity(self->uart_num, UART_PARITY_DISABLE));
            self->parity = 0;
        } else {
            mp_int_t parity = mp_obj_get_int(args[ARG_parity].u_obj);
            if (parity & 1) {
                check_esp_err(uart_set_parity(self->uart_num, UART_PARITY_ODD));
                self->parity = 1;
            } else {
                check_esp_err(uart_set_parity(self->uart_num, UART_PARITY_EVEN));
                self->parity = 2;
            }
        }
    }

    // set stop bits
    switch (args[ARG_stop].u_int) {
        // FIXME: ESP32 also supports 1.5 stop bits
        case 0:
            break;
        case 1:
            check_esp_err(uart_set_stop_bits(self->uart_num, UART_STOP_BITS_1));
            self->stop = 1;
            break;
        case 2:
            check_esp_err(uart_set_stop_bits(self->uart_num, UART_STOP_BITS_2));
            self->stop = 2;
            break;
        default:
            mp_raise_ValueError(MP_ERROR_TEXT("invalid stop bits"));
            break;
    }

