micropython/micropython/ports/esp32/machine_uart.c
    // set timeout
    if (args[ARG_timeout].u_int != -1) {
        self->timeout = args[ARG_timeout].u_int;
    }

    // set timeout_char
    if (args[ARG_timeout_char].u_int != -1) {
        self->timeout_char = args[ARG_timeout_char].u_int;
    }
    // make sure it is at least as long as a whole character (12 bits here)
    uint32_t char_time_ms = 12000 / baudrate + 1;
    uint32_t rx_timeout = self->timeout_char / char_time_ms;
    if (rx_timeout < 1) {
        check_esp_err(uart_set_rx_full_threshold(self->uart_num, 1));
        check_esp_err(uart_set_rx_timeout(self->uart_num, 1));
    } else {
        check_esp_err(uart_set_rx_timeout(self->uart_num, rx_timeout));
    }

    // set line inversion
    if (args[ARG_invert].u_int != -1) {
        if (args[ARG_invert].u_int & ~UART_INV_MASK) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid inversion mask"));
        }
        self->invert = args[ARG_invert].u_int;
    }
    check_esp_err(uart_set_line_inverse(self->uart_num, self->invert));

    // set hardware flow control
    if (args[ARG_flow].u_int != -1) {
        if (args[ARG_flow].u_int & ~UART_HW_FLOWCTRL_CTS_RTS) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid flow control mask"));
        }
        self->flowcontrol = args[ARG_flow].u_int;
    }
    uint8_t uart_fifo_len = UART_HW_FIFO_LEN(self->uart_num);
    check_esp_err(uart_set_hw_flow_ctrl(self->uart_num, self->flowcontrol, uart_fifo_len - uart_fifo_len / 4));

    // discard any input from previous configuration
    check_esp_err(uart_flush_input(self->uart_num));
}

static mp_obj_t mp_machine_uart_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // get uart id
    mp_int_t uart_num = mp_obj_get_int(args[0]);
    if (uart_num < 0 || uart_num >= UART_NUM_MAX) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("UART(%d) does not exist"), uart_num);
    }
    _Static_assert(UART_NUM_MAX == SOC_UART_NUM, "SOC and driver constant should match");

    machine_uart_obj_t *self = MP_STATE_PORT(machine_uart_objs)[uart_num];
    if (self == NULL) {
        // Allocate a new UART object
        self = mp_obj_malloc(machine_uart_obj_t, &machine_uart_type);
        self->uart_num = uart_num;
        // remaining fields are set from inside mp_machine_uart_init_helper()
    }

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_uart_init_helper(self, n_args - 1, args + 1, &kw_args);

    // Make sure pins are connected.
    check_esp_err(uart_set_pin(self->uart_num, self->tx, self->rx, self->rts, self->cts));

    MP_STATE_PORT(machine_uart_objs)[uart_num] = self;

    return MP_OBJ_FROM_PTR(self);
}

static void mp_machine_uart_deinit(machine_uart_obj_t *self) {
    if (self->uart_event_task != NULL) {
        vTaskDelete(self->uart_event_task);
        self->uart_event_task = NULL;
    }
    if (self->rxidle_timer != NULL) {
        machine_timer_stop(self->rxidle_timer);
        if (self->rxidle_state > RXIDLE_STANDBY) {
            // Currently deinit(),init() sequence resumes any previously
            // configured irqs, and we currently also rely on this when changing
            // buffer size - so keep rxidle in standby if it was active
            self->rxidle_state = RXIDLE_STANDBY;
        }
    }
    // Only stop the ESP-IDF driver entirely if it's not the REPL,
    // (if it's the REPL then it shouldn't have any ISR configured anyway.)
    if (!uart_is_repl(self->uart_num)) {
        check_esp_err(uart_driver_delete(self->uart_num));
        self->uart_queue = NULL;
    }
}

void machine_uart_deinit_all(void) {
    for (int i = 0; i < UART_NUM_MAX; i++) {
        machine_uart_obj_t *uart = MP_STATE_PORT(machine_uart_objs)[i];
        if (uart) {
            mp_machine_uart_deinit(uart);
            MP_STATE_PORT(machine_uart_objs)[i] = NULL;
        }
    }
}

static mp_int_t mp_machine_uart_any(machine_uart_obj_t *self) {
    size_t rxbufsize;
    check_esp_err(uart_get_buffered_data_len(self->uart_num, &rxbufsize));
    return rxbufsize;
}

static bool mp_machine_uart_txdone(machine_uart_obj_t *self) {
    return uart_wait_tx_done(self->uart_num, 0) == ESP_OK;
}

static void mp_machine_uart_sendbreak(machine_uart_obj_t *self) {
    // Calculate the length of the break, as 13 bits.
    uint32_t baudrate;
    check_esp_err(uart_get_baudrate(self->uart_num, &baudrate));
    uint32_t break_delay_us = 13000000 / baudrate;

    // Wait for any outstanding data to be transmitted.
    check_esp_err(uart_wait_tx_done(self->uart_num, pdMS_TO_TICKS(1000)));

    // Set the TX pin to output, pull it low, and wait for the break period.
    mp_hal_pin_output(self->tx);
    mp_hal_pin_write(self->tx, 0);
    mp_hal_delay_us(break_delay_us);

    // Restore original UART pin settings.
    check_esp_err(uart_set_pin(self->uart_num, self->tx, self->rx, self->rts, self->cts));
}

// Configure the timer used for IRQ_RXIDLE
static void uart_irq_configure_timer(machine_uart_obj_t *self, mp_uint_t trigger) {

    self->rxidle_state = RXIDLE_INACTIVE;

    if (trigger & UART_IRQ_RXIDLE) {
        // The RXIDLE event is always a soft IRQ.
        self->mp_irq_obj->ishard = false;
        uint32_t baudrate;
        uart_get_baudrate(self->uart_num, &baudrate);
        // Wait for 2 characters worth of time before triggering the RXIDLE event
        uint8_t bits_per_character = 1 + self->bits + self->parity + self->stop;
        uint64_t period_us = ((2 * bits_per_character) * 1000000) / baudrate;
        if (period_us < RXIDLE_TIMER_MIN) {
            period_us = RXIDLE_TIMER_MIN;
        }
        self->rxidle_timer->period = (period_us * machine_timer_freq_hz(self->rxidle_timer)) / 1000000 + 1;
        self->rxidle_timer->repeat = true;
        self->rxidle_timer->handler = uart_timer_callback;
        self->rxidle_timer->handler_ctx = self;
        machine_timer_configure(self->rxidle_timer);
        self->rxidle_state = RXIDLE_STANDBY;
    }
}

static mp_uint_t uart_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);

